/*
 * - Пагінація
 1. Отримати посилання на елементи
 2. Зробити запит за новинами, зробити ф-ю, яка буде шукати articles
 * - вказати параметри сторінка і кількість на сторінці
 4. Обробка submit форми - Завантажуємо статті при надсиланні форми
 5.  Завантажуємо статті при натисканні на кнопку «Завантажити ще»
 * - Оновлюємо сторінку в параметрах запиту
 3. Створити ф-ю renderMarkup - Малюємо статті
 * - Скидаємо значення при пошуку за новим критерієм

// ДОДАТКОВО
// Валідація інпуту
// Налаштувати появу і зникненя кнопки load more
// Налаштувати спінер
// Слідкувати за правильною сторінкою(скидати значення page)
 *
 * https://newsapi.org/
 * 4330ebfabc654a6992c2aa792f3173a3
 * http://newsapi.org/v2/everything?q=cat&language=en&pageSize=5&page=1
 *
 * Додатково
 * створити клас NewsApiService в якому буде реалізована вся логіка роботи
 * з публічним API: зберігання параметрів запиту (query, page),
 * методи отримання статтей fetchArticles, incrementPage, resetPage,
 * геттери та сеттери запиту. js-articles-container
 */
const API_KEY = 'ccbf2b8d847e4e1ba3713150a403ae30';
const BASE_URL = 'https://newsapi.org/v2/'

